Data/Raw data/Varying threads (only workload A, constant record count, target)/couchbase_threads/threads_16/output.txt
[OVERALL], RunTime(ms), 2515
[OVERALL], Throughput(ops/sec), 1988.0715705765408
[TOTAL_GCS_PS_Scavenge], Count, 4
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 44
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.7495029821073558
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 44
[TOTAL_GC_TIME_%], Time(%), 1.7495029821073558
[READ], Operations, 2514
[READ], AverageLatency(us), 3760.56046141607
[READ], MinLatency(us), 93
[READ], MaxLatency(us), 49727
[READ], 95thPercentileLatency(us), 11863
[READ], 99thPercentileLatency(us), 19903
[READ], Return=OK, 2514
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 0.25
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 3
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 3
[UPDATE], Operations, 2486
[UPDATE], AverageLatency(us), 4064.8857602574417
[UPDATE], MinLatency(us), 115
[UPDATE], MaxLatency(us), 45791
[UPDATE], 95thPercentileLatency(us), 12799
[UPDATE], 99thPercentileLatency(us), 24127
[UPDATE], Return=OK, 2486